Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: To get started, the recommended option is to use the LovyanGFX library as the TFT driver, since it makes testing much easier.
it_it: Per iniziare, l'opzione consigliata è quella di utilizzare la libreria LovyanGFX come driver TFT, poiché semplifica notevolmente i test.

source: To get started, the recommended option is to use the ``LovyanGFX library`` as the TFT driver, since it makes testing much easier.
it_it: Per iniziare, l'opzione consigliata è quella di utilizzare la ``LovyanGFX library`` come driver TFT, poiché semplifica notevolmente i test.

source: To get started:
it_it: Per iniziare:

source: To get the *index* of the currently selected item use :cpp:expr:`lv_roller_get_selected(roller)`.
it_it: Per ottenere l'*indice* dell'elemento attualmente selezionato, si usa :cpp:expr:`lv_roller_get_selected(roller)`.

source: To get the *index* of the selected option, use :cpp:expr:`lv_dropdown_get_selected(dropdown)`.
it_it: Per ottenere l'*indice* dell'opzione selezionata, si usa :cpp:expr:`lv_dropdown_get_selected(dropdown)`.

source: To get the best performance out of an LVGL application, select HP.
it_it: Per ottenere le migliori prestazioni da un'applicazione LVGL, selezionare HP.

source: To get the current state of the Switch (with ``true`` being ON), use :cpp:expr:`lv_obj_has_state(widget, LV_STATE_CHECKED)`.
it_it: Per ottenere lo stato corrente dello Switch (con ``true`` impostato su ON), utilizzare :cpp:expr:`lv_obj_has_state(widget, LV_STATE_CHECKED)`.

source: To get the main color use :cpp:expr:`lv_color_t` ``c =`` :cpp:expr:`lv_palette_main(LV_PALETTE_...)`.
it_it: Per ottenere il colore principale, si usa :cpp:expr:`lv_color_t` ``c =`` :cpp:expr:`lv_palette_main(LV_PALETTE_...)`.

source: To get the number of frames in an animation or the current frame index, you can cast the :cpp:struct:`lv_obj_t` instance to a :cpp:struct:`lv_rlottie_t` instance and inspect the ``current_frame`` and ``total_frames`` members.
it_it: Per ottenere il numero di frame in un'animazione o l'indice del frame corrente, è possibile convertire l'istanza :cpp:struct:`lv_obj_t` in un'istanza :cpp:struct:`lv_rlottie_t` e ispezionare i membri ``current_frame`` e ``total_frames``.

source: To get the original target call :cpp:expr:`lv_event_get_target_obj(e)` in the event handler.
it_it: Per ottenere il target originale, si chiama :cpp:expr:`lv_event_get_target_obj(e)` nel gestore eventi.

source: To get the steps in an event callback, use: ``int32_t diff = lv_event_get_rotary_diff(e);``
it_it: Per ottenere i passaggi in una callback di evento, si usa: ``int32_t diff = lv_event_get_rotary_diff(e);``

source: To get the value of the hash of the file, you can do this command: ``md5sum LICENSE.txt``
it_it: Per ottenere il valore dell'hash del file, è possibile eseguire questo comando: ``md5sum LICENSE.txt``

source: To get time elapsed since the last activity, use :cpp:expr:`lv_display_get_inactive_time(display1)`.
it_it: Per ottenere il tempo trascorso dall'ultima attività, si usa :cpp:expr:`lv_display_get_inactive_time(display1)`.

source: To give a better idea on this, lets assume you want to render a 240x320 lottie animation.
it_it: Per dare un'idea più precisa, supponiamo di voler eseguire il rendering di un'animazione Lottie di 240x320.

source: To handle it, the touch array and touch count need to be global variables:
it_it: Per gestirli, l'array touch e il conteggio touch devono essere variabili globali:

source: To handle this you can create an array from the addresses of all the Subjects that are relied upon, and pass that array as a parameter when you initialize a Subject with GROUP type.
it_it: Per gestire questa situazione, è possibile creare un array con gli indirizzi di tutti i Subject su cui si basa e passare tale array come parametro quando si inizializza un Subject con tipo GROUP.

source: To have te best performance and experience you can use the following snippet code to start the LVGL subsystem for ESP-IDF:
it_it: Per ottenere le migliori prestazioni ed esperienza, è possibile utilizzare il seguente frammento di codice per avviare il sottosistema LVGL per ESP-IDF:

source: To horizontally align the lines of a Label the `text_align` style property can be used with :cpp:func:`lv_obj_set_style_text_align` or :cpp:func:`lv_style_set_text_align`, passing one of the ``LV_TEXT_ALIGN_...`` enumeration values.
it_it: Per allineare orizzontalmente le righe di un'etichetta, la proprietà di stile `text_align` può essere utilizzata con :cpp:func:`lv_obj_set_style_text_align` o :cpp:func:`lv_style_set_text_align`, passando uno dei valori di enumerazione ``LV_TEXT_ALIGN_...``.

source: To implement custom mode selection logic, define a callback function and register it with :cpp:func:`lv_linux_drm_set_mode_cb`:
it_it: Per implementare la logica di selezione della modalità personalizzata, definire una funzione di callback e registrarla con :cpp:func:`lv_linux_drm_set_mode_cb`:

source: To include a timeline, use the following properties:
it_it: Per includere una sequenza temporale, utilizzare le seguenti proprietà:

source: To initialize a Subject use ``lv_subject_init_<type>(&subject, params, init_value)``.
it_it: Per inizializzare un Subject, si usa ``lv_subject_init_<type>(&subject, params, init_value)``.

source: To install the Figma to LVGL Plugin, go to the Figma menu -> Plugins -> Manage plugins and find it in the list.
it_it: Per installare il plugin Figma-LVGL, si va al menù "Figma -> Plugins -> Manage plugins" e lo si cerca nell'elenco.

source: To install the plugin in e2 Studio:
it_it: Per installare il plugin in e2 Studio:

source: To invalidate all cached images: :cpp:expr:`lv_image_cache_drop(NULL)`.
it_it: Per invalidare tutte le immagini memorizzate nella cache: :cpp:expr:`lv_image_cache_drop(NULL)`.

source: To iterate through a parent widget's children:
it_it: Per scorrere i widget figlio di un widget padre:

source: To keep the buffer size and the animation size consistent, the size of the Widget (i.e. the size of the animation) is set to the dimensions of the buffer internally.
it_it: Per mantenere coerenti le dimensioni del buffer e quelle dell'animazione, la dimensione del Widget (ovvero la dimensione dell'animazione) viene impostata internamente sulle dimensioni del buffer.

source: To learn how to bind subjects to Arcs, Labels, Sliders, etc. visit the "Data binding" section of the given widget's documentation.
it_it: Per informazioni su come associare gli oggetti ad Archi, Etichette, Slider, ecc., consultare la sezione "Data binding" della documentazione del widget in questione.

source: To learn more about Widgets in XML and the callbacks refer to :ref:`xml_widgets`.
it_it: Per saperne di più sui widget in XML e sulle callback, fare riferimento a :ref:`xml_widgets`.

source: To learn more about how to register the name-data pairs visit :ref:`editor_integration_xml`.
it_it: Per saperne di più su come registrare le coppie nome-dati, visitare :ref:`editor_integration_xml`.

source: To learn more about states, see the related section in :ref:`styles_overview`.
it_it: Per saperne di più sugli stati, consultare la sezione correlata in :ref:`styles_overview`.

source: To learn more about the SDL driver, visit :ref:`sdl_driver`.
it_it: Per saperne di più sul driver SDL, visitare :ref:`sdl_driver`.

source: To learn more about the XML format itself, visit :ref:`this page <xml_main>`.
it_it: Per saperne di più sul formato XML stesso, visitare :ref:`questa pagina <xml_main>`.

source: To learn more refer to the documentation of `MicroPython <integration/bindings/micropython>`__.
it_it: Per ulteriori informazioni, consultare la documentazione di `MicroPython <integration/bindings/micropython>`__.

source: To leave edit mode, long-press the button.
it_it: Per uscire dalla modalità di modifica, premere a lungo il pulsante.

source: To load Components from files, it's assumed that the XML files are saved to the device either as data (byte array) or as files.
it_it: Per caricare i Componenti da file, si presuppone che i file XML vengano salvati sul dispositivo come dati (array di byte) o come file.

source: To load a font :ref:`LVGL's filesystem <file_system>` needs to be enabled and a driver must be added.
it_it: Per caricare un font, :ref:`Il file system di LVGL <file_system>` deve essere abilitato e deve essere aggiunto un driver.

source: To load a font from a buffer :ref:`LVGL's filesystem <file_system>` needs to be enabled and the MEMFS driver must be added.
it_it: Per caricare un font da un buffer, :ref:`Il file system di LVGL <file_system>` deve essere abilitato e deve essere aggiunto il driver MEMFS.

source: To load everything at runtime correctly, the steps need to be executed in this order:
it_it: Per caricare correttamente tutto in fase di esecuzione, i passaggi devono essere eseguiti in questo ordine:

source: To load the LVGL GDB plugin within GDB's command line, type the following command:
it_it: Per caricare il plugin GDB LVGL dalla riga di comando di GDB, digitare il seguente comando:

source: To make LVGL check all Widgets to see if they use a style and refresh them when needed, call :cpp:expr:`lv_obj_report_style_change(&style)`.
it_it: Per fare in modo che LVGL controlli tutti i Widget per vedere se utilizzano uno stile e aggiornarli quando necessario, chiamare :cpp:expr:`lv_obj_report_style_change(&style)`.

source: To make Widgets accessible from XML, an XML parser needs to be created and registered for each Widget.
it_it: Per rendere i widget accessibili da XML, è necessario creare e registrare un parser XML per ogni widget.

source: To make a Widget a Flex container call :cpp:expr:`lv_obj_set_layout(widget, LV_LAYOUT_FLEX)`.
it_it: Per trasformare un Widget in un contenitore Flex, si chiama :cpp:expr:`lv_obj_set_layout(widget, LV_LAYOUT_FLEX)`.

source: To make a Widget a Grid container call :cpp:expr:`lv_obj_set_layout(widget, LV_LAYOUT_GRID)`.
it_it: Per trasformare un Widget in un contenitore Grid, chiamare :cpp:expr:`lv_obj_set_layout(widget, LV_LAYOUT_GRID)`.

source: To make a screen visible, it needs to be "loaded".
it_it: Per rendere visibile uno Screen, è necessario "caricarlo".

source: To make fonts globally available (like the built-in fonts), add them to :c:macro:`LV_FONT_CUSTOM_DECLARE` in ``lv_conf.h``.
it_it: Per rendere i font disponibili globalmente (come quelli nativi), si aggiungono a :c:macro:`LV_FONT_CUSTOM_DECLARE` in ``lv_conf.h``.

source: To make it interactive, you would need to add custom event handling, as it does not inherit clickability by default.
it_it: Per renderla interattiva, è necessario aggiungere una gestione eventi personalizzata, poiché non eredita la cliccabilità per default.

source: To make it possible to utilize such facilities in the most efficient fashion, LVGL v9 and onwards implements a :dfn:`Drawing Pipeline`, like an assembly line, where decisions are made as to which drawing tasks (:ref:`Draw Tasks`) are given to which "logic entities" (:ref:`Draw Units`) in order to be carried out.
it_it: Per consentire l'utilizzo di tali funzionalità nel modo più efficiente, LVGL v9 e versioni successive implementano una :dfn:`Pipeline di Disegno`, simile a una catena di montaggio, in cui vengono prese decisioni su quali attività di disegno (:ref:`Draw Tasks`) assegnare a quali "entità logiche" (:ref:`Draw Units`) per essere eseguite.

source: To make it work, set up TFT_eSPI according to your TFT display type via editing either:
it_it: Per farla funzionare, configurare TFT_eSPI in base al tipo di display TFT modificando:

source: To make it work, set up ``TFT_eSPI`` according to your TFT display type via editing either:
it_it: Per farla funzionare, si configura ``TFT_eSPI`` in base al tipo di display TFT modificando:

source: To make the Calendar flexible, by default it does not show the current year or month.
it_it: Per rendere il Calendar flessibile, per default non mostra l'anno o il mese corrente.

source: To make the DCO easier to digest, here are some practical guides about specific cases:
it_it: Per rendere il DCO più facile da comprendere, ecco alcune guide pratiche su casi specifici:

source: To make the LVGL project sustainable, please consider :ref:`contributing` to the project.
it_it: Per rendere sostenibile il progetto LVGL, preghiamo di considerare la possibilità di :ref:`contributing`.

source: To make the arc non-adjustable, remove the style of the knob and make the Widget non-clickable:
it_it: Per rendere l'arco non regolabile, rimuovere lo stile della manopola e rendere il Widget non cliccabile:

source: To make the converted image variable accessible from the C file, declare it with :cpp:expr:`LV_IMAGE_DECLARE(converted_img_var)`.
it_it: Per rendere accessibile la variabile immagine convertita dal file C, dichiararla con :cpp:expr:`LV_IMAGE_DECLARE(converted_img_var)`.

source: To make your configuration permanent, add the following lines to ``sdkconfig.defaults``:
it_it: Per rendere permanente la configurazione, aggiungere le seguenti righe a ``sdkconfig.defaults``:

source: To manage placement of children use :cpp:expr:`lv_obj_set_flex_align(widget, main_place, cross_place, track_cross_place)` which makes the parent Widget model the Flex-container behavior defined `here <justify-content_>`_.
it_it: Per gestire il posizionamento degli elementi figlio, si usa :cpp:expr:`lv_obj_set_flex_align(widget, main_place, cross_place, track_cross_place)` che fa sì che il modello del widget padre imposti il comportamento del contenitore Flex definito `qui <justify-content_>`_.

source: To manage the channels separately:
it_it: Per gestire i canali separatamente:

source: To manually send events to a Widget, use ``lv_obj_send_event(widget, <EVENT_CODE>, &some_data)``.
it_it: Per inviare manualmente eventi a un widget, utilizzare ``lv_obj_send_event(widget, <EVENT_CODE>, &some_data)``.

source: To maximize the score on the LVGL benchmark and maximize the performance of an LVGL application in general, ensure the HP core is selected and the build type is release.
it_it: Per massimizzare il punteggio nel benchmark LVGL e massimizzare le prestazioni di un'applicazione LVGL in generale, deve essere selezionato il core HP e il tipo di build dev'essere release.

source: To merge more adjacent cells, call this function for each cell.
it_it: Per unire più celle adiacenti, si chiama questa funzione per ciascuna cella.

source: To mirror the image of a display to another display, you don't need to use multi-display support.
it_it: Per il mirroring dell'immagine di un display su un altro display, non è necessario utilizzare il supporto multi-display.

source: To mitigate this delay, there is a set of functions provided to upload the assets early.
it_it: Per mitigare questo ritardo, è disponibile una serie di funzioni per caricare le risorse in anticipo.

source: To modify the minimum space Grid inserts between Widgets, the following properties can be set on the Grid container style:
it_it: Per modificare lo spazio minimo di inserimento della Grid tra i widget, è possibile impostare le seguenti proprietà nello stile del contenitore della Grid:

source: To modify the minimum space flexbox inserts between Widgets, the following functions can be used to set the flex container padding style:
it_it: Per modificare lo spazio minimo inserito da Flexbox tra i Widget, è possibile utilizzare le seguenti funzioni per impostare lo stile della spaziatura del contenitore Flex:

source: To move the focus to the next widget of the group use :cpp:enumerator:`LV_KEY_NEXT` or :cpp:enumerator:`LV_KEY_PREV`.
it_it: Per spostare il focus sul widget successivo del gruppo, si usa :cpp:enumerator:`LV_KEY_NEXT` o :cpp:enumerator:`LV_KEY_PREV`.

source: To optimize LVGL's performance, several `kconfig` options can be configured:
it_it: Per ottimizzare le prestazioni di LVGL, è possibile configurare diverse opzioni `kconfig`:

source: To power next-gen's AI requirements in industrial and other harsh environments, Aquila introduces a proven connector: the 400-pin board-to-board connector, making the board extra reliable, especially in these environments.
it_it: Per soddisfare i requisiti di intelligenza artificiale di nuova generazione in ambienti industriali e in altri ambienti difficili, Aquila introduce un connettore collaudato: il connettore board-to-board a 400 pin, che rende la scheda estremamente affidabile, soprattutto in questi ambienti.

source: To prevent GC from collecting memory prematurely, all dynamic allocated RAM must be reachable by the GC.
it_it: Per evitare che il GC liberi la memoria prematuramente, tutta la RAM allocata dinamicamente deve essere raggiungibile dal GC.

source: To prevent display-related issues, it is recommended to ensure all devices, including the HDMI display, are connected and powered on before powering up the board.
it_it: Per evitare problemi relativi al display, si consiglia di assicurarsi che tutti i dispositivi, incluso il display HDMI, siano collegati e accesi prima di accendere la scheda madre.

source: To prevent passing the gesture event to the parent from a widget, use :cpp:expr:`lv_obj_remove_flag(widget, LV_OBJ_FLAG_GESTURE_BUBBLE)`.
it_it: Per impedire il passaggio dell'evento "gesture" al genitore da un widget, si usa :cpp:expr:`lv_obj_remove_flag(widget, LV_OBJ_FLAG_GESTURE_BUBBLE)`.

source: To prevent this behavior is interesting to make `CONFIG_LV_DRAW_BUF_ALIGN` to be a multiple of the cache L1 line size, that is it, set its value to `64` instead of the default of `4`.
it_it: Per evitare questo comportamento, è utile impostare `CONFIG_LV_DRAW_BUF_ALIGN` su un multiplo della dimensione della linea L1 della cache, ovvero impostarne il valore su `64` invece del `4` di default.

source: To programmatically add or remove states use:
it_it: Per aggiungere o rimuovere stati a livello di codice, utilizzare:

source: To programmatically fullscreen the window, use the ``lv_wayland_window_set_fullscreen()`` function respectively with ``true`` or ``false`` for the ``fullscreen`` argument.
it_it: Per impostare la finestra a schermo intero tramite programmazione, utilizzare la funzione ``lv_wayland_window_set_fullscreen()`` rispettivamente con ``true`` o ``false`` per l'argomento ``fullscreen``.

source: To programmatically maximize the window, use the ``lv_wayland_window_set_maximized()`` function respectively with ``true`` or ``false`` for the ``maximized`` argument.
it_it: Per massimizzare la finestra tramite programmazione, utilizzare la funzione ``lv_wayland_window_set_maximized()`` rispettivamente con ``true`` o ``false`` per l'argomento ``maximized``.

source: To programmatically minimize the window, use the ``lv_wayland_window_set_minimized()`` function.
it_it: Per ridurre a icona la finestra a livello di codice, utilizzare la funzione ``lv_wayland_window_set_minimized()``.

source: To programmatically open or close the Drop-Down List use :cpp:expr:`lv_dropdown_open(dropdown)` or :cpp:expr:`lv_dropdown_close(dropdown)`.
it_it: Per aprire o chiudere programmaticamente la Drop-Down List si usa :cpp:expr:`lv_dropdown_open(dropdown)` o :cpp:expr:`lv_dropdown_close(dropdown)`.

source: To properly render a UI on a transparent Screen the Display's color format needs to be set to one with an alpha channel (for example LV_COLOR_FORMAT_ARGB8888).
it_it: Per visualizzare correttamente un'interfaccia utente su uno schermo trasparente, il formato colore del display deve essere impostato su uno con un canale alfa (ad esempio LV_COLOR_FORMAT_ARGB8888).

source: To provide maximum flexibility, the source of the image can be:
it_it: Per garantire la massima flessibilità, la sorgente dell'immagine può essere:

source: To quickly resolve such issues, strict parameter checking has been added before each VG-Lite call, including buffer stride validation and matrix invertibility check.
it_it: Per risolvere rapidamente tali problemi, è stato aggiunto un rigoroso controllo dei parametri prima di ogni chiamata a VG-Lite, che include la convalida del buffer stride e il controllo dell'invertibilità della matrice.

source: To read and decode PNG images and to store the converted rendered image, a few MBs of RAM are dynamically allocated using the standard ``malloc`` (not :cpp:expr:`lv_malloc`).
it_it: Per leggere e decodificare le immagini PNG e per memorizzare l'immagine renderizzata convertita, alcuni MB di RAM vengono allocati dinamicamente utilizzando il ``malloc`` standard (non :cpp:expr:`lv_malloc`).

source: To refresh all parts and properties use :cpp:expr:`lv_obj_refresh_style(widget, LV_PART_ANY, LV_STYLE_PROP_ANY)`.
it_it: Per aggiornare tutte le parti e le proprietà, utilizzare :cpp:expr:`lv_obj_refresh_style(widget, LV_PART_ANY, LV_STYLE_PROP_ANY)`.

source: To register XML translations:
it_it: Per registrare le traduzioni XML:

source: To register a community license, go to the ``bin`` folder of the compiler and, in a terminal, run ``armlm.exe activate -server https://mdk-preview.keil.arm.com -product KEMDK-COM0`` (On Linux, use ``./armlm``).
it_it: Per registrare una licenza community, andare alla cartella ``bin`` del compilatore e, in un terminale, eseguire ``armlm.exe activate -server https://mdk-preview.keil.arm.com -product KEMDK-COM0`` (Su Linux, usare ``./armlm``).

source: To register and use callbacks one of the following needs to be followed.
it_it: Per registrare e utilizzare le callback, è necessario seguire una delle seguenti procedure.

source: To remove a property use:
it_it: Per rimuovere una proprietà, utilizzare:

source: To remove all styles from a Widget use :cpp:expr:`lv_obj_remove_style_all(widget)`.
it_it: Per rimuovere tutti gli stili da un widget, utilizzare :cpp:expr:`lv_obj_remove_style_all(widget)`.

source: To remove specific styles use ``lv_obj_remove_style(widget, &style, selector)``.
it_it: Per rimuovere stili specifici, si usa ``lv_obj_remove_style(widget, &style, selector)``.

source: To remove the physical display assignment and return to default behavior, use ``lv_wayland_unassign_physical_display()``:
it_it: Per rimuovere l'assegnazione del display fisico e ripristinare il comportamento di default, si usa ``lv_wayland_unassign_physical_display()``:

source: To replace a specific style of a Widget use :cpp:expr:`lv_obj_replace_style(widget, old_style, new_style, selector)`.
it_it: Per sostituire uno stile specifico di un widget, si usa :cpp:expr:`lv_obj_replace_style(widget, old_style, new_style, selector)`.

source: To request permission for broader use or commercial licensing (e.g. using this Specification in your own UI tool), contact:
it_it: Per richiedere l'autorizzazione per un uso più ampio o una licenza commerciale (ad esempio, l'utilizzo di questa Specifica nel proprio strumento di interfaccia utente), contattare:

source: To reset a style (freeing all its data) use:
it_it: Per resettare uno stile (liberando tutti i suoi dati) utilizzare:

source: To restore default behavior, call :cpp:func:`lv_linux_drm_set_mode_cb` with ``NULL`` as the callback.
it_it: Per ripristinare il comportamento di default, chiamare :cpp:func:`lv_linux_drm_set_mode_cb` con ``NULL`` come callback.

source: To retrieve a translation for a given tag, use:
it_it: Per recuperare una traduzione per un determinato tag, si usa:

source: To retrieve size information:
it_it: Per recuperare informazioni sulle dimensioni:

source: To rotate the image use :cpp:expr:`lv_image_set_rotation(img, angle_x10)`.
it_it: Per ruotare l'immagine, si usa :cpp:expr:`lv_image_set_rotation(img, angle_x10)`.

source: To run the application on your host:
it_it: Per eseguire l'applicazione sul proprio host:
